Revit 2027 API
BuiltInFailures.StairRampFailures.RampStartHigherThanEnd Property
 The ramp's base (base level + base offset) must be below its top (top level + top offset).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RampStartHigherThanEnd { get; }
Public Shared ReadOnly Property RampStartHigherThanEnd As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RampStartHigherThanEnd {
	FailureDefinitionId^ get ();
}
static member RampStartHigherThanEnd : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace